{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor": {"name": "keras_tensor:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_15_1/conv2d_transpose_7_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/conv2d_transpose_7_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/conv2d_transpose_7_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/conv2d_transpose_7_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/conv2d_transpose_7_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/conv2d_transpose_7_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/conv2d_transpose_7_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_14_1/conv2d_transpose_6_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_14_1/conv2d_transpose_6_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_14_1/conv2d_transpose_6_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_14_1/conv2d_transpose_6_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_14_1/conv2d_transpose_6_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_14_1/conv2d_transpose_6_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_14_1/conv2d_transpose_6_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_13_1/conv2d_transpose_5_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_13_1/conv2d_transpose_5_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_13_1/conv2d_transpose_5_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_13_1/conv2d_transpose_5_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_13_1/conv2d_transpose_5_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_13_1/conv2d_transpose_5_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_13_1/conv2d_transpose_5_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_7_1/conv2d_7_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_7_1/batch_normalization_6_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/batch_normalization_7_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_6_1/conv2d_6_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_6_1/batch_normalization_5_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/batch_normalization_8_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/batch_normalization_8_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_5_1/conv2d_5_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_5_1/batch_normalization_4_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_1_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/batch_normalization_9_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/batch_normalization_9_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_4_1/conv2d_4_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_4_1/batch_normalization_3_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_2_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/batch_normalization_10_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/batch_normalization_10_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_3_1/conv2d_3_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_3_1/batch_normalization_2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_3_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/batch_normalization_11_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/batch_normalization_11_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_2_1/conv2d_2_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_2_1/batch_normalization_1_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_4_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_13_1/batch_normalization_12_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_13_1/batch_normalization_12_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_1_2/conv2d_1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_1_2/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_5_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_14_1/batch_normalization_13_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_14_1/batch_normalization_13_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_1/conv2d_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_6_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/conv2d_transpose_7_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_1/conv2d_1/convolution", "op": "Conv2D", "input": ["keras_tensor", "StatefulPartitionedCall/functional_15_1/sequential_1/conv2d_1/convolution/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_1/leaky_re_lu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/functional_15_1/sequential_1/conv2d_1/convolution"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_1_2/leaky_re_lu_1_1/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_15_1/sequential_1/leaky_re_lu_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/sequential_1_2/conv2d_1_1/convolution/merged_input", "StatefulPartitionedCall/functional_15_1/sequential_1_2/batch_normalization_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_2_1/leaky_re_lu_2_1/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_15_1/sequential_1_2/leaky_re_lu_1_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/sequential_2_1/conv2d_2_1/convolution/merged_input", "StatefulPartitionedCall/functional_15_1/sequential_2_1/batch_normalization_1_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_3_1/leaky_re_lu_3_1/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_15_1/sequential_2_1/leaky_re_lu_2_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/sequential_3_1/conv2d_3_1/convolution/merged_input", "StatefulPartitionedCall/functional_15_1/sequential_3_1/batch_normalization_2_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_4_1/leaky_re_lu_4_1/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_15_1/sequential_3_1/leaky_re_lu_3_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/sequential_4_1/conv2d_4_1/convolution/merged_input", "StatefulPartitionedCall/functional_15_1/sequential_4_1/batch_normalization_3_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_5_1/leaky_re_lu_5_1/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_15_1/sequential_4_1/leaky_re_lu_4_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/sequential_5_1/conv2d_5_1/convolution/merged_input", "StatefulPartitionedCall/functional_15_1/sequential_5_1/batch_normalization_4_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_6_1/leaky_re_lu_6_1/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_15_1/sequential_5_1/leaky_re_lu_5_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/sequential_6_1/conv2d_6_1/convolution/merged_input", "StatefulPartitionedCall/functional_15_1/sequential_6_1/batch_normalization_5_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_7_1/leaky_re_lu_7_1/LeakyRelu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_15_1/sequential_6_1/leaky_re_lu_6_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/sequential_7_1/conv2d_7_1/convolution/merged_input", "StatefulPartitionedCall/functional_15_1/sequential_7_1/batch_normalization_6_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_15_1/sequential_7_1/leaky_re_lu_7_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/Shape", "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose/input_sizes", "StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/functional_15_1/sequential_7_1/leaky_re_lu_7_1/LeakyRelu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/batch_normalization_7_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_15_1/sequential_8_1/conv2d_transpose_1/conv_transpose", "StatefulPartitionedCall/functional_15_1/sequential_8_1/batch_normalization_7_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_8_1/re_lu_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15_1/sequential_8_1/batch_normalization_7_1/batchnorm/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15_1/sequential_8_1/re_lu_1/Relu", "StatefulPartitionedCall/functional_15_1/sequential_6_1/leaky_re_lu_6_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/concatenate_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_15_1/concatenate_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/Shape", "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/strided_slice/stack", "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/strided_slice", "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose/input_sizes", "StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/functional_15_1/concatenate_1/concat"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/batch_normalization_8_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_15_1/sequential_9_1/conv2d_transpose_1_1/conv_transpose", "StatefulPartitionedCall/functional_15_1/sequential_9_1/batch_normalization_8_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/batch_normalization_8_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_15_1/sequential_9_1/batch_normalization_8_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_15_1/sequential_9_1/batch_normalization_8_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_9_1/re_lu_1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15_1/sequential_9_1/batch_normalization_8_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_1_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15_1/sequential_9_1/re_lu_1_1/Relu", "StatefulPartitionedCall/functional_15_1/sequential_5_1/leaky_re_lu_5_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/concatenate_1_2/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_15_1/concatenate_1_2/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/Shape", "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/strided_slice/stack", "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/strided_slice", "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose/input_sizes", "StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/functional_15_1/concatenate_1_2/concat"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/batch_normalization_9_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_15_1/sequential_10_1/conv2d_transpose_2_1/conv_transpose", "StatefulPartitionedCall/functional_15_1/sequential_10_1/batch_normalization_9_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/batch_normalization_9_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_15_1/sequential_10_1/batch_normalization_9_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_15_1/sequential_10_1/batch_normalization_9_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_10_1/re_lu_2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15_1/sequential_10_1/batch_normalization_9_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_2_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15_1/sequential_10_1/re_lu_2_1/Relu", "StatefulPartitionedCall/functional_15_1/sequential_4_1/leaky_re_lu_4_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/concatenate_2_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_15_1/concatenate_2_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/Shape", "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/strided_slice/stack", "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/strided_slice", "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose/input_sizes", "StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/functional_15_1/concatenate_2_1/concat"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/batch_normalization_10_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_15_1/sequential_11_1/conv2d_transpose_3_1/conv_transpose", "StatefulPartitionedCall/functional_15_1/sequential_11_1/batch_normalization_10_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/batch_normalization_10_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_15_1/sequential_11_1/batch_normalization_10_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_15_1/sequential_11_1/batch_normalization_10_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_11_1/re_lu_3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15_1/sequential_11_1/batch_normalization_10_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_3_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15_1/sequential_11_1/re_lu_3_1/Relu", "StatefulPartitionedCall/functional_15_1/sequential_3_1/leaky_re_lu_3_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/concatenate_3_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_15_1/concatenate_3_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/Shape", "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/strided_slice/stack", "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/strided_slice", "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose/input_sizes", "StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/functional_15_1/concatenate_3_1/concat"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/batch_normalization_11_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_15_1/sequential_12_1/conv2d_transpose_4_1/conv_transpose", "StatefulPartitionedCall/functional_15_1/sequential_12_1/batch_normalization_11_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/batch_normalization_11_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_15_1/sequential_12_1/batch_normalization_11_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_15_1/sequential_12_1/batch_normalization_11_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/sequential_12_1/re_lu_4_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_15_1/sequential_12_1/batch_normalization_11_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_15_1/concatenate_4_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_15_1/sequential_12_1/re_lu_4_1/Relu", "StatefulPartitionedCall/functional_15_1/sequential_2_1/leaky_re_lu_2_1/LeakyRelu", "StatefulPartitionedCall/functional_15_1/concatenate_4_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": 